#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Test Cases

Some simple grids to test printing and single round advancement.

#+NAME: single-round-combat
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#.GE.#"
                               "#....#"
                               "######"))))
    (print-grid game)
    (execute-round game)
    (print-grid game))
#+END_SRC

Expected result: both start at 200 HP, both end at 197 HP.

#+RESULTS: single-round-combat
#+begin_example
Round #0
######
#.GE.# (E 200 3) (G 200 3)
#....#
######
Elf HP: 200
Goblin HP: 200
Round #1
######
#.GE.# (E 197 3) (G 197 3)
#....#
######
Elf HP: 197
Goblin HP: 197
#+end_example

#+NAME: full-round-combat
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#.GE.#"
                               "#....#"
                               "######"))))
    (run-game game))
#+END_SRC

The goblin should survive, and he does. He wins because he hits
first.
#+RESULTS: full-round-combat
#+begin_example
Round #0
######
#.GE.# (E 200 3) (G 200 3)
#....#
######
Elf HP: 200
Goblin HP: 200
Round #67
######
#.G..# (G 2 3)
#....#
######
Elf HP: 0
Goblin HP: 2
#+end_example

#+NAME: two-on-one-combat
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#.GE.#"
                               "#..G.#"
                               "######"))))
    (run-game game))
#+END_SRC

Expected: Elf dies after 200/6 rounds (rounded down, so round 33). Top
Goblin has HP reduced by 3 33 times to 101 HP. Bottom Goblin has full
health. This gives me confidence my round count is correct.
#+RESULTS: two-on-one-combat
#+begin_example
Round #0
######
#.GE.# (E 200 3) (G 200 3)
#..G.# (G 200 3)
######
Elf HP: 200
Goblin HP: 400
Round #33
######
#.G..# (G 101 3)
#..G.# (G 200 3)
######
Elf HP: 0
Goblin HP: 301
#+end_example

#+NAME: single-movement
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#..G.#"
                               "#....#"
                               "#..E.#"
                               "######"))))
    (run-game game))
#+END_SRC

Expected: The Goblin moves one south, and is attacked on that same
round by the ELf. This gives the Elf the advantage of first attack and
he wins after 67 rounds.
#+RESULTS: single-movement
#+begin_example
Round #0
######
#..G.# (G 200 3)
#....#
#..E.# (E 200 3)
######
Elf HP: 200
Goblin HP: 200
Round #1001
######
#..G.# (G 200 3)
#....#
#..E.# (E 200 3)
######
Elf HP: 200
Goblin HP: 200
#+end_example

#+NAME: tc-18740
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "#########"
                               "#G......#"
                               "#.E.#...#"
                               "#..##..G#"
                               "#...##..#"
                               "#...#...#"
                               "#.G...G.#"
                               "#.....G.#"
                               "#########"))))
        (run-game game))
#+END_SRC

#+RESULTS: tc-18740
#+begin_example
Round #0
#########
#G......# (G 200 3)
#.E.#...# (E 200 3)
#..##..G# (G 200 3)
#...##..#
#...#...#
#.G...G.# (G 200 3) (G 200 3)
#.....G.# (G 200 3)
#########
Elf HP: 200
Goblin HP: 1000
Round #1001
#########
#G......# (G 200 3)
#.E.#...# (E 200 3)
#..##..G# (G 200 3)
#...##..#
#...#...#
#.G...G.# (G 200 3) (G 200 3)
#.....G.# (G 200 3)
#########
Elf HP: 200
Goblin HP: 1000
#+end_example

#+NAME: complex-movement-example
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "#########"
                               "#G..G..G#"
                               "#.......#"
                               "#.......#"
                               "#G..E..G#"
                               "#.......#"
                               "#.......#"
                               "#G..G..G#"
                               "#########"))))
    (iter (repeat 4)
          (print-grid game)
          (execute-round game))
    (print-grid game))
#+END_SRC

#+RESULTS: complex-movement-example
#+begin_example
Round #0
#########
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#.......#
#.......#
#G..E..G# (G 200 3) (E 200 3) (G 200 3)
#.......#
#.......#
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#########
Elf HP: 200
Goblin HP: 1600
Round #1
#########
#.....G.# (G 200 3)
#G..G...# (G 197 3) (G 200 3)
#...E..G# (G 200 3) (E 200 3)
#.G.....# (G 200 3)
#.......#
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#.......#
#########
Elf HP: 200
Goblin HP: 1597
Round #2
#########
#....G..# (G 200 3)
#...G...# (G 194 3)
#GG.E.G.# (G 200 3) (E 197 3) (G 200 3) (G 200 3)
#.......#
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#.......#
#.......#
#########
Elf HP: 197
Goblin HP: 1594
Round #3
#########
#.......#
#G..GG..# (G 200 3) (G 191 3) (G 200 3)
#..GEG..# (G 200 3) (E 185 3) (G 200 3)
#G..G...# (G 200 3) (G 200 3)
#......G# (G 200 3)
#.......#
#.......#
#########
Elf HP: 185
Goblin HP: 1591
Round #4
#########
#.......#
#G..GG..# (G 200 3) (G 188 3) (G 200 3)
#..GEG..# (G 200 3) (E 173 3) (G 200 3)
#G..G...# (G 200 3) (G 200 3)
#......G# (G 200 3)
#.......#
#.......#
#########
Elf HP: 173
Goblin HP: 1588
#+end_example

#+NAME: test-cases
#+BEGIN_SRC lisp :results output :exports both
  (def-suite aoc.2018.15)
  (in-suite aoc.2018.15)

  (test manhattan
    (is (= 0 (manhattan-distance (complex 0 0) (complex 0 0))))
    (is (= 1 (manhattan-distance (complex 0 1) (complex 0 0))))
    (is (= 3 (manhattan-distance (complex 1 1) (complex 3 0)))))

  (test reading-order
    (is (equal `((#C(0 0) 4) (#C(1 1) 3))
               (reading-order '((#C(1 1) 3) (#C(0 0) 4))))))

  (run! 'aoc.2018.15)
#+END_SRC
